In [1]:
# Some configuations
# This cell defines a magic command to ensure that the script doesn't stop due
# to any error arising in that cell.
from IPython.core.magic import register_cell_magic
@register_cell_magic('handle')
def handle(line, cell):
    try:
#         exec(cell)  # doesn't return the cell output though
        return eval(cell)
    except Exception as exc:
        print(f"\033[1;31m{exc.__class__.__name__} : \033[1;31;47m{exc}\033[0m")
        # raise # if you want the full trace-back in the notebook

# Indexing

In [5]:
import numpy as np
import pandas as pd
pd.read_csv('data/table.csv').head()

  School Class    ID Gender   Address  Height  Weight  Math Physics
0    S_1   C_1  1101      M  street_1     173      63  34.0      A+
1    S_1   C_1  1102      F  street_2     192      73  32.5      B+
2    S_1   C_1  1103      M  street_2     186      82  87.2      B+
3    S_1   C_1  1104      F  street_2     167      81  80.4      B-
4    S_1   C_1  1105      F  street_4     159      64  84.8      B+

In [6]:

df = pd.read_csv('data/table.csv', index_col='ID')
df.head(10)

     School Class Gender   Address  Height  Weight  Math Physics
ID
1101    S_1   C_1      M  street_1     173      63  34.0      A+
1102    S_1   C_1      F  street_2     192      73  32.5      B+
1103    S_1   C_1      M  street_2     186      82  87.2      B+
1104    S_1   C_1      F  street_2     167      81  80.4      B-
1105    S_1   C_1      F  street_4     159      64  84.8      B+
1201    S_1   C_2      M  street_5     188      68  97.0      A-
1202    S_1   C_2      F  street_4     176      94  63.5      B-
1203    S_1   C_2      M  street_6     160      53  58.8      A+
1204    S_1   C_2      F  street_5     162      63  33.8       B
1205    S_1   C_2      F  street_6     167      63  68.4      B-

## (1) [] method

```[]``` method can be used to select column(s) by passing column name(s) (label(s)). Although it also can be used to select row(s), to avoid confusion, we will leave selecting rows to the other two methods, which we will talk about later.

```df[colname]``` Select single column

In [7]:
df["Address"].head()

ID
1101    street_1
1102    street_2
1103    street_2
1104    street_2
1105    street_4
Name: Address, dtype: object

In [8]:
df[["Address"]].head()

       Address
ID
1101  street_1
1102  street_2
1103  street_2
1104  street_2
1105  street_4

```df[[col1, col2,..., coln]]``` Select multiple columns

In [9]:
df[["Address", "Math"]].head()

       Address  Math
ID
1101  street_1  34.0
1102  street_2  32.5
1103  street_2  87.2
1104  street_2  80.4
1105  street_4  84.8

## (2) loc method

**loc** can be used to index row(s) and column(s) by providing the row and column labels.

```df.loc[row_label(s)]``` Selects single row or subset of rows from the DataFrame by label.

In [10]:
df.loc[1105] # index single row

School          S_1
Class           C_1
Gender            F
Address    street_4
Height          159
Weight           64
Math           84.8
Physics          B+
Name: 1105, dtype: object

In [11]:
df.loc[[1105]] # index single row and keep the dimension

     School Class Gender   Address  Height  Weight  Math Physics
ID
1105    S_1   C_1      F  street_4     159      64  84.8      B+

In [12]:
df.loc[1105:1203] # index multiple rows

     School Class Gender   Address  Height  Weight  Math Physics
ID
1105    S_1   C_1      F  street_4     159      64  84.8      B+
1201    S_1   C_2      M  street_5     188      68  97.0      A-
1202    S_1   C_2      F  street_4     176      94  63.5      B-
1203    S_1   C_2      M  street_6     160      53  58.8      A+

In [13]:
%%handle
df.loc[[1105:1203]] # index multiple rows

SyntaxError : invalid syntax (<string>, line 1)

In [14]:
df.loc[[1105, 1102, 1202, 1203]] # index multiple rows

     School Class Gender   Address  Height  Weight  Math Physics
ID
1105    S_1   C_1      F  street_4     159      64  84.8      B+
1102    S_1   C_1      F  street_2     192      73  32.5      B+
1202    S_1   C_2      F  street_4     176      94  63.5      B-
1203    S_1   C_2      M  street_6     160      53  58.8      A+

```df.loc[:, col_labels]``` Selects single column or subset of columns by label

In [15]:
df.loc[:, "School"] # index single column

ID
1101    S_1
1102    S_1
1103    S_1
1104    S_1
1105    S_1
1201    S_1
1202    S_1
1203    S_1
1204    S_1
1205    S_1
1301    S_1
1302    S_1
1303    S_1
1304    S_1
1305    S_1
2101    S_2
2102    S_2
2103    S_2
2104    S_2
2105    S_2
2201    S_2
2202    S_2
2203    S_2
2204    S_2
2205    S_2
2301    S_2
2302    S_2
2303    S_2
2304    S_2
2305    S_2
2401    S_2
2402    S_2
2403    S_2
2404    S_2
2405    S_2
Name: School, dtype: object

In [16]:
df.loc[:, "School":"Weight"].head() # index multiple columns

     School Class Gender   Address  Height  Weight
ID
1101    S_1   C_1      M  street_1     173      63
1102    S_1   C_1      F  street_2     192      73
1103    S_1   C_1      M  street_2     186      82
1104    S_1   C_1      F  street_2     167      81
1105    S_1   C_1      F  street_4     159      64

In [17]:
df.loc[:, ["School", "Weight", "Address"]].tail() # index multiple columns

     School  Weight   Address
ID
2401    S_2      62  street_2
2402    S_2      82  street_7
2403    S_2      60  street_6
2404    S_2      84  street_2
2405    S_2      54  street_6

```df.loc[row_label(s), col_label(s)]``` Select both rows and columns by label

In [18]:
df.loc[[1105], ["Address"]]

       Address
ID
1105  street_4

In [19]:
df.loc[[1105], "Address"]

ID
1105    street_4
Name: Address, dtype: object

In [20]:
df.loc[1105, ["Address"]]

Address    street_4
Name: 1105, dtype: object

In [21]:
df.loc[1105, "Address"]

'street_4'

In [22]:
df.loc[1105:1205, ["Address", "Math"]]

       Address  Math
ID
1105  street_4  84.8
1201  street_5  97.0
1202  street_4  63.5
1203  street_6  58.8
1204  street_5  33.8
1205  street_6  68.4

In [23]:
df.index

Index([1101, 1102, 1103, 1104, 1105, 1201, 1202, 1203, 1204, 1205, 1301, 1302,
       1303, 1304, 1305, 2101, 2102, 2103, 2104, 2105, 2201, 2202, 2203, 2204,
       2205, 2301, 2302, 2303, 2304, 2305, 2401, 2402, 2403, 2404, 2405],
      dtype='int64', name='ID')

In [24]:
df.columns

Index(['School', 'Class', 'Gender', 'Address', 'Height', 'Weight', 'Math',
       'Physics'],
      dtype='object')

Index by function

In [25]:
df.head()

     School Class Gender   Address  Height  Weight  Math Physics
ID
1101    S_1   C_1      M  street_1     173      63  34.0      A+
1102    S_1   C_1      F  street_2     192      73  32.5      B+
1103    S_1   C_1      M  street_2     186      82  87.2      B+
1104    S_1   C_1      F  street_2     167      81  80.4      B-
1105    S_1   C_1      F  street_4     159      64  84.8      B+

In [26]:
df.loc[lambda x:x['Gender']=='M'].head() # here x stands for each row in df

     School Class Gender   Address  Height  Weight  Math Physics
ID
1101    S_1   C_1      M  street_1     173      63  34.0      A+
1103    S_1   C_1      M  street_2     186      82  87.2      B+
1201    S_1   C_2      M  street_5     188      68  97.0      A-
1203    S_1   C_2      M  street_6     160      53  58.8      A+
1301    S_1   C_3      M  street_4     161      68  31.5      B+

Index by Boolean Series

In [27]:
df['Address'].head(10)

ID
1101    street_1
1102    street_2
1103    street_2
1104    street_2
1105    street_4
1201    street_5
1202    street_4
1203    street_6
1204    street_5
1205    street_6
Name: Address, dtype: object

In [28]:
df['Address'].isin(['street_7','street_4'])

ID
1101    False
1102    False
1103    False
1104    False
1105     True
1201    False
1202     True
1203    False
1204    False
1205    False
1301     True
1302    False
1303     True
1304    False
1305    False
2101     True
2102    False
2103     True
2104    False
2105     True
2201    False
2202     True
2203     True
2204    False
2205     True
2301     True
2302    False
2303     True
2304    False
2305     True
2401    False
2402     True
2403    False
2404    False
2405    False
Name: Address, dtype: bool

In [29]:
type(df['Address'].isin(['street_7','street_4']))

pandas.core.series.Series

In [30]:
idx = df['Address'].isin(['street_7','street_4'])
df.loc[idx]

     School Class Gender   Address  Height  Weight  Math Physics
ID
1105    S_1   C_1      F  street_4     159      64  84.8      B+
1202    S_1   C_2      F  street_4     176      94  63.5      B-
1301    S_1   C_3      M  street_4     161      68  31.5      B+
1303    S_1   C_3      M  street_7     188      82  49.7       B
2101    S_2   C_1      M  street_7     174      84  83.3       C
2103    S_2   C_1      M  street_4     157      61  52.5      B-
2105    S_2   C_1      M  street_4     170      81  34.2       A
2202    S_2   C_2      F  street_7     194      77  68.5      B+
2203    S_2   C_2      M  street_4     155      91  73.8      A+
2205    S_2   C_2      F  street_7     183      76  85.4       B
2301    S_2   C_3      F  street_4     157      78  72.3      B+
2303    S_2   C_3      F  street_7     190      99  65.9       C
2305    S_2   C_3      M  street_4     187      73  48.9       B
2402    S_2   C_4      M  street_7     166      82  48.7       B

In [31]:
idx = df['Physics'].isin(['B+', 'A', 'A+'])
df.loc[idx]

     School Class Gender   Address  Height  Weight  Math Physics
ID
1101    S_1   C_1      M  street_1     173      63  34.0      A+
1102    S_1   C_1      F  street_2     192      73  32.5      B+
1103    S_1   C_1      M  street_2     186      82  87.2      B+
1105    S_1   C_1      F  street_4     159      64  84.8      B+
1203    S_1   C_2      M  street_6     160      53  58.8      A+
1301    S_1   C_3      M  street_4     161      68  31.5      B+
1304    S_1   C_3      M  street_2     195      70  85.2       A
2102    S_2   C_1      F  street_6     161      61  50.6      B+
2104    S_2   C_1      F  street_5     159      97  72.2      B+
2105    S_2   C_1      M  street_4     170      81  34.2       A
2202    S_2   C_2      F  street_7     194      77  68.5      B+
2203    S_2   C_2      M  street_4     155      91  73.8      A+
2301    S_2   C_3      F  street_4     157      78  72.3      B+
2302    S_2   C_3      M  street_5     171      88  32.7       A
2401    S_2   C_4      F  street_2     192      62  45.3       A
2403    S_2   C_4      F  street_6     158      60  59.7      B+

In [32]:
df.loc[(df["Physics"] == "A+") & (df["Math"] >= 60)] # use "&" (and), "|" (or)  "~" (not) for Pandas

     School Class Gender   Address  Height  Weight  Math Physics
ID
2203    S_2   C_2      M  street_4     155      91  73.8      A+

In [33]:
df["Physics"] == "A+"

ID
1101     True
1102    False
1103    False
1104    False
1105    False
1201    False
1202    False
1203     True
1204    False
1205    False
1301    False
1302    False
1303    False
1304    False
1305    False
2101    False
2102    False
2103    False
2104    False
2105    False
2201    False
2202    False
2203     True
2204    False
2205    False
2301    False
2302    False
2303    False
2304    False
2305    False
2401    False
2402    False
2403    False
2404    False
2405    False
Name: Physics, dtype: bool

In [34]:
df["Math"] >= 60

ID
1101    False
1102    False
1103     True
1104     True
1105     True
1201     True
1202     True
1203    False
1204    False
1205     True
1301    False
1302     True
1303    False
1304     True
1305     True
2101     True
2102    False
2103    False
2104     True
2105    False
2201    False
2202     True
2203     True
2204    False
2205     True
2301     True
2302    False
2303     True
2304     True
2305    False
2401    False
2402    False
2403    False
2404     True
2405    False
Name: Math, dtype: bool

In [35]:
(df["Physics"] == "A+") & (df["Math"] >= 60)

ID
1101    False
1102    False
1103    False
1104    False
1105    False
1201    False
1202    False
1203    False
1204    False
1205    False
1301    False
1302    False
1303    False
1304    False
1305    False
2101    False
2102    False
2103    False
2104    False
2105    False
2201    False
2202    False
2203     True
2204    False
2205    False
2301    False
2302    False
2303    False
2304    False
2305    False
2401    False
2402    False
2403    False
2404    False
2405    False
dtype: bool

In [36]:
df.loc[(df["Gender"] == "F") | (df["Height"] >= 170), ["School", "Class"]]

     School Class
ID
1101    S_1   C_1
1102    S_1   C_1
1103    S_1   C_1
1104    S_1   C_1
1105    S_1   C_1
1201    S_1   C_2
1202    S_1   C_2
1204    S_1   C_2
1205    S_1   C_2
1302    S_1   C_3
1303    S_1   C_3
1304    S_1   C_3
1305    S_1   C_3
2101    S_2   C_1
2102    S_2   C_1
2104    S_2   C_1
2105    S_2   C_1
2201    S_2   C_2
2202    S_2   C_2
2204    S_2   C_2
2205    S_2   C_2
2301    S_2   C_3
2302    S_2   C_3
2303    S_2   C_3
2304    S_2   C_3
2305    S_2   C_3
2401    S_2   C_4
2403    S_2   C_4
2404    S_2   C_4
2405    S_2   C_4

## (3) iloc method

**iloc** can be used to index row(s) and column(s) by providing the row and column integer(s).

```df.iloc[row_integer(s)]``` Selects single row or subset of rows from the DataFrame by integer position

**Note**: same as indexing for sequence (but different with ```loc```, it is 0 basis and the selection is close to the left and open to the right (the last item is excluded).

In [37]:
df.iloc[[3]]

     School Class Gender   Address  Height  Weight  Math Physics
ID
1104    S_1   C_1      F  street_2     167      81  80.4      B-

In [38]:
df.iloc[3]

School          S_1
Class           C_1
Gender            F
Address    street_2
Height          167
Weight           81
Math           80.4
Physics          B-
Name: 1104, dtype: object

In [39]:
df.iloc[:4] # 5th item is not selected

     School Class Gender   Address  Height  Weight  Math Physics
ID
1101    S_1   C_1      M  street_1     173      63  34.0      A+
1102    S_1   C_1      F  street_2     192      73  32.5      B+
1103    S_1   C_1      M  street_2     186      82  87.2      B+
1104    S_1   C_1      F  street_2     167      81  80.4      B-

```df.iloc[:, col_integer(s)]``` Selects single column or multiple columns from the DataFrame by integer positions

In [40]:
df.iloc[:, 1:3] # 4th column is not selected

     Class Gender
ID
1101   C_1      M
1102   C_1      F
1103   C_1      M
1104   C_1      F
1105   C_1      F
1201   C_2      M
1202   C_2      F
1203   C_2      M
1204   C_2      F
1205   C_2      F
1301   C_3      M
1302   C_3      F
1303   C_3      M
1304   C_3      M
1305   C_3      F
2101   C_1      M
2102   C_1      F
2103   C_1      M
2104   C_1      F
2105   C_1      M
2201   C_2      M
2202   C_2      F
2203   C_2      M
2204   C_2      M
2205   C_2      F
2301   C_3      F
2302   C_3      M
2303   C_3      F
2304   C_3      F
2305   C_3      M
2401   C_4      F
2402   C_4      M
2403   C_4      F
2404   C_4      F
2405   C_4      F

```df.iloc[row_integer(s), col_integer(s)]``` Selects row and columns from the DataFrame by integer positions

In [41]:
df.iloc[-1::-5, 1:3]

     Class Gender
ID
2405   C_4      F
2305   C_3      M
2205   C_2      F
2105   C_1      M
1305   C_3      F
1205   C_2      F
1105   C_1      F

In [42]:
list(range(35, 0, -5))

[35, 30, 25, 20, 15, 10, 5]

Index by Boolean **values**

When pass Boolean to `iloc` method, you need to first convert the series as values to `iloc`; it does not take Pandas Series

In [43]:
%%handle
df.iloc[(df["Physics"] == "A+") & (df["Math"] >= 60)]

NotImplementedError : iLocation based boolean indexing on an integer type is not available

In [44]:
type((df["Physics"] == "A+"))

pandas.core.series.Series

In [45]:
type((df["Physics"] == "A+").values)

numpy.ndarray

In [46]:
df.iloc[(df["Physics"] == "A+").values]

     School Class Gender   Address  Height  Weight  Math Physics
ID
1101    S_1   C_1      M  street_1     173      63  34.0      A+
1203    S_1   C_2      M  street_6     160      53  58.8      A+
2203    S_2   C_2      M  street_4     155      91  73.8      A+

In [47]:
df.iloc[(df["Physics"] == "A+").values & (df["Math"] >= 60).values]

     School Class Gender   Address  Height  Weight  Math Physics
ID
2203    S_2   C_2      M  street_4     155      91  73.8      A+

In [48]:
df.iloc[((df["Physics"] == "A+") & (df["Math"] >= 60)).values]

     School Class Gender   Address  Height  Weight  Math Physics
ID
2203    S_2   C_2      M  street_4     155      91  73.8      A+

# Data processing

In data analysis, we usually do 

* **split**: Split our data into different groups based on some key(s).
* **apply**: Apply some functions to each group.

![split_apply](figures/split_apply.png)

## split

```goupby``` function can be used to split our data into different groups.

### Group by single column

In [49]:
 df

     School Class Gender   Address  Height  Weight  Math Physics
ID
1101    S_1   C_1      M  street_1     173      63  34.0      A+
1102    S_1   C_1      F  street_2     192      73  32.5      B+
1103    S_1   C_1      M  street_2     186      82  87.2      B+
1104    S_1   C_1      F  street_2     167      81  80.4      B-
1105    S_1   C_1      F  street_4     159      64  84.8      B+
1201    S_1   C_2      M  street_5     188      68  97.0      A-
1202    S_1   C_2      F  street_4     176      94  63.5      B-
1203    S_1   C_2      M  street_6     160      53  58.8      A+
1204    S_1   C_2      F  street_5     162      63  33.8       B
1205    S_1   C_2      F  street_6     167      63  68.4      B-
1301    S_1   C_3      M  street_4     161      68  31.5      B+
1302    S_1   C_3      F  street_1     175      57  87.7      A-
1303    S_1   C_3      M  street_7     188      82  49.7       B
1304    S_1   C_3      M  street_2     195      70  85.2       A
1305    S_1   C_3      F  street_5     187      69  61.7      B-
2101    S_2   C_1      M  street_7     174      84  83.3       C
2102    S_2   C_1      F  street_6     161      61  50.6      B+
2103    S_2   C_1      M  street_4     157      61  52.5      B-
2104    S_2   C_1      F  street_5     159      97  72.2      B+
2105    S_2   C_1      M  street_4     170      81  34.2       A
2201    S_2   C_2      M  street_5     193     100  39.1       B
2202    S_2   C_2      F  street_7     194      77  68.5      B+
2203    S_2   C_2      M  street_4     155      91  73.8      A+
2204    S_2   C_2      M  street_1     175      74  47.2      B-
2205    S_2   C_2      F  street_7     183      76  85.4       B
2301    S_2   C_3      F  street_4     157      78  72.3      B+
2302    S_2   C_3      M  street_5     171      88  32.7       A
2303    S_2   C_3      F  street_7     190      99  65.9       C
2304    S_2   C_3      F  street_6     164      81  95.5      A-
2305    S_2   C_3      M  street_4     187      73  48.9       B
2401    S_2   C_4      F  street_2     192      62  45.3       A
2402    S_2   C_4      M  street_7     166      82  48.7       B
2403    S_2   C_4      F  street_6     158      60  59.7      B+
2404    S_2   C_4      F  street_2     160      84  67.7       B
2405    S_2   C_4      F  street_6     193      54  47.6       B

In [50]:
grouped_single = df.groupby('School') # key here is School
grouped_single

In [51]:
grouped_single.get_group('S_1').head() # get specific group

     School Class Gender   Address  Height  Weight  Math Physics
ID
1101    S_1   C_1      M  street_1     173      63  34.0      A+
1102    S_1   C_1      F  street_2     192      73  32.5      B+
1103    S_1   C_1      M  street_2     186      82  87.2      B+
1104    S_1   C_1      F  street_2     167      81  80.4      B-
1105    S_1   C_1      F  street_4     159      64  84.8      B+

In [52]:
grouped_single.get_group('S_2').head() # get specific group

     School Class Gender   Address  Height  Weight  Math Physics
ID
2101    S_2   C_1      M  street_7     174      84  83.3       C
2102    S_2   C_1      F  street_6     161      61  50.6      B+
2103    S_2   C_1      M  street_4     157      61  52.5      B-
2104    S_2   C_1      F  street_5     159      97  72.2      B+
2105    S_2   C_1      M  street_4     170      81  34.2       A

In [53]:
grouped_single.groups

{'S_1': [1101, 1102, 1103, 1104, 1105, 1201, 1202, 1203, 1204, 1205, 1301, 1302, 1303, 1304, 1305], 'S_2': [2101, 2102, 2103, 2104, 2105, 2201, 2202, 2203, 2204, 2205, 2301, 2302, 2303, 2304, 2305, 2401, 2402, 2403, 2404, 2405]}

In [54]:
grouped_single.size()

School
S_1    15
S_2    20
dtype: int64

In [55]:
grouped_single.ngroups

2

In [56]:
grouped_single.first() # first row of each group

       Class Gender   Address  Height  Weight  Math Physics
School
S_1      C_1      M  street_1     173      63  34.0      A+
S_2      C_1      M  street_7     174      84  83.3       C

In [57]:
grouped_single.head() # first five rows of each group

     School Class Gender   Address  Height  Weight  Math Physics
ID
1101    S_1   C_1      M  street_1     173      63  34.0      A+
1102    S_1   C_1      F  street_2     192      73  32.5      B+
1103    S_1   C_1      M  street_2     186      82  87.2      B+
1104    S_1   C_1      F  street_2     167      81  80.4      B-
1105    S_1   C_1      F  street_4     159      64  84.8      B+
2101    S_2   C_1      M  street_7     174      84  83.3       C
2102    S_2   C_1      F  street_6     161      61  50.6      B+
2103    S_2   C_1      M  street_4     157      61  52.5      B-
2104    S_2   C_1      F  street_5     159      97  72.2      B+
2105    S_2   C_1      M  street_4     170      81  34.2       A

### group by numeric column

In [58]:
mathgroup = df.groupby(lambda x: "Greater than or equal to 60" if df.loc[x, "Math"]>= 60 else "Less than 60")
mathgroup.get_group("Greater than or equal to 60")

     School Class Gender   Address  Height  Weight  Math Physics
ID
1103    S_1   C_1      M  street_2     186      82  87.2      B+
1104    S_1   C_1      F  street_2     167      81  80.4      B-
1105    S_1   C_1      F  street_4     159      64  84.8      B+
1201    S_1   C_2      M  street_5     188      68  97.0      A-
1202    S_1   C_2      F  street_4     176      94  63.5      B-
1205    S_1   C_2      F  street_6     167      63  68.4      B-
1302    S_1   C_3      F  street_1     175      57  87.7      A-
1304    S_1   C_3      M  street_2     195      70  85.2       A
1305    S_1   C_3      F  street_5     187      69  61.7      B-
2101    S_2   C_1      M  street_7     174      84  83.3       C
2104    S_2   C_1      F  street_5     159      97  72.2      B+
2202    S_2   C_2      F  street_7     194      77  68.5      B+
2203    S_2   C_2      M  street_4     155      91  73.8      A+
2205    S_2   C_2      F  street_7     183      76  85.4       B
2301    S_2   C_3      F  street_4     157      78  72.3      B+
2303    S_2   C_3      F  street_7     190      99  65.9       C
2304    S_2   C_3      F  street_6     164      81  95.5      A-
2404    S_2   C_4      F  street_2     160      84  67.7       B

In [59]:
mathgroup.get_group("Less than 60")

     School Class Gender   Address  Height  Weight  Math Physics
ID
1101    S_1   C_1      M  street_1     173      63  34.0      A+
1102    S_1   C_1      F  street_2     192      73  32.5      B+
1203    S_1   C_2      M  street_6     160      53  58.8      A+
1204    S_1   C_2      F  street_5     162      63  33.8       B
1301    S_1   C_3      M  street_4     161      68  31.5      B+
1303    S_1   C_3      M  street_7     188      82  49.7       B
2102    S_2   C_1      F  street_6     161      61  50.6      B+
2103    S_2   C_1      M  street_4     157      61  52.5      B-
2105    S_2   C_1      M  street_4     170      81  34.2       A
2201    S_2   C_2      M  street_5     193     100  39.1       B
2204    S_2   C_2      M  street_1     175      74  47.2      B-
2302    S_2   C_3      M  street_5     171      88  32.7       A
2305    S_2   C_3      M  street_4     187      73  48.9       B
2401    S_2   C_4      F  street_2     192      62  45.3       A
2402    S_2   C_4      M  street_7     166      82  48.7       B
2403    S_2   C_4      F  street_6     158      60  59.7      B+
2405    S_2   C_4      F  street_6     193      54  47.6       B

#### ```cut``` method

In [60]:
bins = [0,40,60,80,90,100]
cuts = pd.cut(df['Math'],bins=bins) 
cuts

ID
1101      (0, 40]
1102      (0, 40]
1103     (80, 90]
1104     (80, 90]
1105     (80, 90]
1201    (90, 100]
1202     (60, 80]
1203     (40, 60]
1204      (0, 40]
1205     (60, 80]
1301      (0, 40]
1302     (80, 90]
1303     (40, 60]
1304     (80, 90]
1305     (60, 80]
2101     (80, 90]
2102     (40, 60]
2103     (40, 60]
2104     (60, 80]
2105      (0, 40]
2201      (0, 40]
2202     (60, 80]
2203     (60, 80]
2204     (40, 60]
2205     (80, 90]
2301     (60, 80]
2302      (0, 40]
2303     (60, 80]
2304    (90, 100]
2305     (40, 60]
2401     (40, 60]
2402     (40, 60]
2403     (40, 60]
2404     (60, 80]
2405     (40, 60]
Name: Math, dtype: category
Categories (5, interval[int64, right]): [(0, 40] < (40, 60] < (60, 80] < (80, 90] < (90, 100]]

In [61]:
df.groupby(cuts, observed=True).groups

{(0, 40]: [1101, 1102, 1204, 1301, 2105, 2201, 2302], (40, 60]: [1203, 1303, 2102, 2103, 2204, 2305, 2401, 2402, 2403, 2405], (60, 80]: [1202, 1205, 1305, 2104, 2202, 2203, 2301, 2303, 2404], (80, 90]: [1103, 1104, 1105, 1302, 1304, 2101, 2205], (90, 100]: [1201, 2304]}

In the above code, the `observed` determines whether the grouping process includes only those combinations of categorical levels that appear in your data (observed combinations) or includes all possible combinations of categories, even if some combinations don't appear in the data.

- **`observed=True`**: Group only by observed combinations (appearing in the dataset).
- **`observed=False`**: Group all possible combinations, including ones that may not appear in the dataset.

In [62]:
df.groupby(cuts, observed=True).size()

Math
(0, 40]       7
(40, 60]     10
(60, 80]      9
(80, 90]      7
(90, 100]     2
dtype: int64

### Group by multiple columns

In [63]:
grouped_mul = df.groupby(['School','Class'])
grouped_mul.size()

School  Class
S_1     C_1      5
        C_2      5
        C_3      5
S_2     C_1      5
        C_2      5
        C_3      5
        C_4      5
dtype: int64

In [64]:
grouped_mul.groups

{('S_1', 'C_1'): [1101, 1102, 1103, 1104, 1105], ('S_1', 'C_2'): [1201, 1202, 1203, 1204, 1205], ('S_1', 'C_3'): [1301, 1302, 1303, 1304, 1305], ('S_2', 'C_1'): [2101, 2102, 2103, 2104, 2105], ('S_2', 'C_2'): [2201, 2202, 2203, 2204, 2205], ('S_2', 'C_3'): [2301, 2302, 2303, 2304, 2305], ('S_2', 'C_4'): [2401, 2402, 2403, 2404, 2405]}

In [65]:
grouped_mul.get_group(('S_2','C_4'))

     School Class Gender   Address  Height  Weight  Math Physics
ID
2401    S_2   C_4      F  street_2     192      62  45.3       A
2402    S_2   C_4      M  street_7     166      82  48.7       B
2403    S_2   C_4      F  street_6     158      60  59.7      B+
2404    S_2   C_4      F  street_2     160      84  67.7       B
2405    S_2   C_4      F  street_6     193      54  47.6       B

## Aggregation

Aggregation means the data can be aggregated into a single quantity to describe the data, for example: mean, median, std, etc

### ```apply``` method

In [66]:
grouped_single['Math'].apply(lambda x: x.sum()) # here, x stands for the data from each group

School
S_1     956.2
S_2    1191.1
Name: Math, dtype: float64

In [67]:
grouped_mul['Height'].apply(lambda x: x.max()-x.min()) # range for each group

School  Class
S_1     C_1      33
        C_2      28
        C_3      34
S_2     C_1      17
        C_2      39
        C_3      33
        C_4      35
Name: Height, dtype: int64

### ```agg``` method

In [68]:
df.columns

Index(['School', 'Class', 'Gender', 'Address', 'Height', 'Weight', 'Math',
       'Physics'],
      dtype='object')

In [69]:
grouped_single[['Math', 'Height', 'Weight']].agg(['sum','mean','std'])

          Math                       Height                        Weight  \
           sum       mean        std    sum        mean        std    sum
School
S_1      956.2  63.746667  23.077474   2636  175.733333  12.713697   1050
S_2     1191.1  59.555000  17.589305   3459  172.950000  14.336097   1563


         mean        std
School
S_1     70.00  10.836446
S_2     78.15  13.456656

In [70]:
grouped_single.agg({'Height': ['sum','mean','std'], 'Weight': ['median', 'mean', 'max']})

       Height                        Weight
          sum        mean        std median   mean  max
School
S_1      2636  175.733333  12.713697   68.0  70.00   94
S_2      3459  172.950000  14.336097   79.5  78.15  100

In [71]:
grouped_single["Math"].agg([('your columna name for math sum','sum'),('math_mean','mean')])

        your columna name for math sum  math_mean
School
S_1                              956.2  63.746667
S_2                             1191.1  59.555000

In [72]:
grouped_mul.agg({'Height': [('Height_mean','mean'),('Height_std','std')],
                 'Weight': [('Weight_median','median'),('Weight_min','min')]})

                  Height                   Weight
             Height_mean Height_std Weight_median Weight_min
School Class
S_1    C_1         175.4  13.538833          73.0         63
       C_2         170.6  11.523888          63.0         53
       C_3         181.2  13.386560          69.0         57
S_2    C_1         164.2   7.395945          81.0         61
       C_2         180.0  16.000000          77.0         74
       C_3         173.8  14.342245          81.0         73
       C_4         173.8  17.326281          62.0         54

In [73]:
grouped_mul.agg({'Height': [('range', lambda x: x.max()-x.min())],
                 'Weight': [('IQR', lambda x: x.quantile(0.75)-x.quantile(0.25))]})

             Height Weight
              range    IQR
School Class
S_1    C_1       33   17.0
       C_2       28    5.0
       C_3       34    2.0
S_2    C_1       17   23.0
       C_2       39   15.0
       C_3       33   10.0
       C_4       35   22.0

### frequency table by ```pd.crosstab``` method

For categorical variables, the frequency table is often used to summarize the data. You can use ```pd.crosstab``` method to generate frequency tables

In [74]:
df

     School Class Gender   Address  Height  Weight  Math Physics
ID
1101    S_1   C_1      M  street_1     173      63  34.0      A+
1102    S_1   C_1      F  street_2     192      73  32.5      B+
1103    S_1   C_1      M  street_2     186      82  87.2      B+
1104    S_1   C_1      F  street_2     167      81  80.4      B-
1105    S_1   C_1      F  street_4     159      64  84.8      B+
1201    S_1   C_2      M  street_5     188      68  97.0      A-
1202    S_1   C_2      F  street_4     176      94  63.5      B-
1203    S_1   C_2      M  street_6     160      53  58.8      A+
1204    S_1   C_2      F  street_5     162      63  33.8       B
1205    S_1   C_2      F  street_6     167      63  68.4      B-
1301    S_1   C_3      M  street_4     161      68  31.5      B+
1302    S_1   C_3      F  street_1     175      57  87.7      A-
1303    S_1   C_3      M  street_7     188      82  49.7       B
1304    S_1   C_3      M  street_2     195      70  85.2       A
1305    S_1   C_3      F  street_5     187      69  61.7      B-
2101    S_2   C_1      M  street_7     174      84  83.3       C
2102    S_2   C_1      F  street_6     161      61  50.6      B+
2103    S_2   C_1      M  street_4     157      61  52.5      B-
2104    S_2   C_1      F  street_5     159      97  72.2      B+
2105    S_2   C_1      M  street_4     170      81  34.2       A
2201    S_2   C_2      M  street_5     193     100  39.1       B
2202    S_2   C_2      F  street_7     194      77  68.5      B+
2203    S_2   C_2      M  street_4     155      91  73.8      A+
2204    S_2   C_2      M  street_1     175      74  47.2      B-
2205    S_2   C_2      F  street_7     183      76  85.4       B
2301    S_2   C_3      F  street_4     157      78  72.3      B+
2302    S_2   C_3      M  street_5     171      88  32.7       A
2303    S_2   C_3      F  street_7     190      99  65.9       C
2304    S_2   C_3      F  street_6     164      81  95.5      A-
2305    S_2   C_3      M  street_4     187      73  48.9       B
2401    S_2   C_4      F  street_2     192      62  45.3       A
2402    S_2   C_4      M  street_7     166      82  48.7       B
2403    S_2   C_4      F  street_6     158      60  59.7      B+
2404    S_2   C_4      F  street_2     160      84  67.7       B
2405    S_2   C_4      F  street_6     193      54  47.6       B

In [75]:
pd.crosstab(index = df.Gender, columns='count')

col_0   count
Gender
F          19
M          16

In [76]:
pd.crosstab(index = "count", columns=df.Class)

Class  C_1  C_2  C_3  C_4
row_0
count   10   10   10    5

In [77]:
pd.crosstab(index = df.Gender, columns=df.Class)

Class   C_1  C_2  C_3  C_4
Gender
F         5    5    5    4
M         5    5    5    1

In [78]:
pd.crosstab(index = df.Gender, columns=df.Class, margins=True)

Class   C_1  C_2  C_3  C_4  All
Gender
F         5    5    5    4   19
M         5    5    5    1   16
All      10   10   10    5   35

#### relative frequency table

In [79]:
pd.crosstab(index = df.Gender, columns='count', normalize=True)

col_0      count
Gender
F       0.542857
M       0.457143

In [80]:
pd.crosstab(index = "count", columns=df.Class, normalize=True)

Class       C_1       C_2       C_3       C_4
row_0
count  0.285714  0.285714  0.285714  0.142857

In [81]:
pd.crosstab(df.Gender, df.Class, margins=True, normalize=False)

Class   C_1  C_2  C_3  C_4  All
Gender
F         5    5    5    4   19
M         5    5    5    1   16
All      10   10   10    5   35

In [82]:
pd.crosstab(df.Gender, df.Class, margins=True, normalize=True)

Class        C_1       C_2       C_3       C_4       All
Gender
F       0.142857  0.142857  0.142857  0.114286  0.542857
M       0.142857  0.142857  0.142857  0.028571  0.457143
All     0.285714  0.285714  0.285714  0.142857  1.000000

# Join

When we have two datesets, we can combine them together

## ```assign``` method

```assign``` method can be used when you want to combine column-wise

In [83]:
maths = [x+10 for x in df['Math']]
heights = [x+10 for x in df['Weight']]
df.assign(new_math=maths, new_height=heights).head()

,School,Class,Gender,Address,Height,Weight,Math,Physics,new_math,new_height
ID,,,,,,,,,,
1101,S_1,C_1,M,street_1,173,63,34.0,A+,44.0,73
1102,S_1,C_1,F,street_2,192,73,32.5,B+,42.5,83
1103,S_1,C_1,M,street_2,186,82,87.2,B+,97.2,92
1104,S_1,C_1,F,street_2,167,81,80.4,B-,90.4,91
1105,S_1,C_1,F,street_4,159,64,84.8,B+,94.8,74

In [84]:
df.head() # no change to original df

     School Class Gender   Address  Height  Weight  Math Physics
ID
1101    S_1   C_1      M  street_1     173      63  34.0      A+
1102    S_1   C_1      F  street_2     192      73  32.5      B+
1103    S_1   C_1      M  street_2     186      82  87.2      B+
1104    S_1   C_1      F  street_2     167      81  80.4      B-
1105    S_1   C_1      F  street_4     159      64  84.8      B+

In [85]:
df['new_math2']=maths
df.head()

     School Class Gender   Address  Height  Weight  Math Physics  new_math2
ID
1101    S_1   C_1      M  street_1     173      63  34.0      A+       44.0
1102    S_1   C_1      F  street_2     192      73  32.5      B+       42.5
1103    S_1   C_1      M  street_2     186      82  87.2      B+       97.2
1104    S_1   C_1      F  street_2     167      81  80.4      B-       90.4
1105    S_1   C_1      F  street_4     159      64  84.8      B+       94.8

## ```concat``` method

```pd.concat([df1, df2], axis = 0)``` can be used to combine two dataframe either row-wise or column-wise depends on value of **axis**: 

* 0 (default, row-wise)
* 1 (column-wise).

In [86]:
df1 = pd.DataFrame({'A': ['A0', 'A1'], 'B': ['B0', 'B1']}, index = [0,1])
df1

    A   B
0  A0  B0
1  A1  B1

In [87]:
df2 = pd.DataFrame({'A': ['A2', 'A3'], 'B': ['B2', 'B3']}, index = [2,3])
df2

    A   B
2  A2  B2
3  A3  B3

In [88]:
df3 = pd.DataFrame({'A': ['A1', 'A3'], 'B': ['D1', 'D3']}, index = [1,3])
df3

    A   B
1  A1  D1
3  A3  D3

In [89]:
pd.concat([df1, df2]) # default axis=0

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [90]:
a = pd.concat([df1, df3])
a

    A   B
0  A0  B0
1  A1  B1
1  A1  D1
3  A3  D3

In [91]:

a.loc[1]

    A   B
1  A1  B1
1  A1  D1

In [92]:
pd.concat([df1, df2], axis = 1)

     A    B    A    B
0   A0   B0  NaN  NaN
1   A1   B1  NaN  NaN
2  NaN  NaN   A2   B2
3  NaN  NaN   A3   B3

In [93]:
df4 = pd.concat([df1, df2], axis = 1)
df4['A']

     A    A
0   A0  NaN
1   A1  NaN
2  NaN   A2
3  NaN   A3

In [94]:
df1['A']

0    A0
1    A1
Name: A, dtype: object

## ```join``` method

The ```join``` method takes two dataframes and joins them on their indexes

In [95]:
# Dataframe of number of sales made by an employee
sales = pd.DataFrame([103, 202, 380, 101, 82, 99, 500],
                     index = ['Tony', 'Sally', 'Randy','Ellen','Fred', 'Tom', 'HanWei'],
                     columns=['sales'])
# Dataframe of all employees and the region they work in
regions = pd.DataFrame(['West', 'South', 'West', 'North', 'South', 'North', 'East', 'West'],
                     index = ['Tony', 'Sally', 'Carl', 'Archie', 'Randy','Ellen','Fred', 'Mo'],
                     columns=['regions'])

In [96]:
sales

        sales
Tony      103
Sally     202
Randy     380
Ellen     101
Fred       82
Tom        99
HanWei    500

In [97]:
regions

       regions
Tony      West
Sally    South
Carl      West
Archie   North
Randy    South
Ellen    North
Fred      East
Mo        West

### left join (default)

Join based on the table on the indeces of the "left" table. Indeces that are not in the left will not be shown

In [98]:
sales.join(regions)

        sales regions
Tony      103    West
Sally     202   South
Randy     380   South
Ellen     101   North
Fred       82    East
Tom        99     NaN
HanWei    500     NaN

### right join 

Join based on the table on the indeces of the "right" table. Indeces that are not in the right will not be shown

In [99]:
sales.join(regions, how='right')

        sales regions
Tony    103.0    West
Sally   202.0   South
Carl      NaN    West
Archie    NaN   North
Randy   380.0   South
Ellen   101.0   North
Fred     82.0    East
Mo        NaN    West

In [100]:
regions.join(sales)

       regions  sales
Tony      West  103.0
Sally    South  202.0
Carl      West    NaN
Archie   North    NaN
Randy    South  380.0
Ellen    North  101.0
Fred      East   82.0
Mo        West    NaN

### inner join 

Only show indeces if they are available in both table (Think this as intersection operation of set)

In [101]:
regions.join(sales, how='inner')

      regions  sales
Tony     West    103
Sally   South    202
Randy   South    380
Ellen   North    101
Fred     East     82

### outer join 

Show indeces if they they exist in one table (Think this as union operation of set)

In [102]:
regions.join(sales, how='outer')

       regions  sales
Archie   North    NaN
Carl      West    NaN
Ellen    North  101.0
Fred      East   82.0
HanWei     NaN  500.0
Mo        West    NaN
Randy    South  380.0
Sally    South  202.0
Tom        NaN   99.0
Tony      West  103.0